"""
МОДУЛЬ 3
Программа "Личный счет"
Описание работы программы:
Пользователь запускает программу у него на счету 0
Программа предлагает следующие варианты действий
1. пополнить счет
2. покупка
3. история покупок
4. выход
1. пополнение счета
при выборе этого пункта пользователю предлагается ввести сумму на сколько пополнить счет
после того как пользователь вводит сумму она добавляется к счету
снова попадаем в основное меню
2. покупка
при выборе этого пункта пользователю предлагается ввести сумму покупки
если она больше количества денег на счете, то сообщаем что денег не хватает и переходим в основное меню
если денег достаточно предлагаем пользователю ввести название покупки, например (еда)
снимаем деньги со счета
сохраняем покупку в историю
выходим в основное меню
3. история покупок
выводим историю покупок пользователя (название и сумму)
возвращаемся в основное меню
4. выход
выход из программы
При выполнении задания можно пользоваться любыми средствами
Для реализации основного меню можно использовать пример ниже или написать свой
"""


def put():
    global balance
    summ = float(input('Введите сумму пополнения:\t'))
    balance += summ
    print(f'Ваш текущий баланс составляет {balance}')
    # return balance + summ


def buy():
    global balance
    global his
    summ = float(input('Введите сумму покупки:\t'))
    if summ > balance:
        print('Недостаточно средств, оформите кредит или овердрафт')
    else:
        prod = input('Что будете приобретать?:\t')
        balance -= summ
        his.append((prod, summ))


def history():
    global his
    for item in his:
        print(f'{item[0]} на сумму {item[1]}')


balance = 0
his = []
while True:
    print('1. пополнение счета')
    print('2. покупка')
    print('3. история покупок')
    print('4. выход')

    choice = input('\nВыберите пункт меню:\t')
    if choice == '1':
        put()
    elif choice == '2':
        buy()
    elif choice == '3':
        history()
    elif choice == '4':
        print('Bye! See you later :)')
        break
    else:
        print('Неверный пункт меню')
